In [2]:
import numpy as np
import pandas as pd

In [3]:
sozluk = {"Istanbul" : [30,32,np.nan], "Ankara":[28,np.nan,27], "Izmır": [34,32,33]}
hava_durumu = pd.DataFrame(sozluk)

In [4]:
hava_durumu

   Istanbul  Ankara  Izmır
0      30.0    28.0     34
1      32.0     NaN     32
2       NaN    27.0     33

In [5]:
hava_durumu.dropna()
#bir satırda veya sütunda nan olursa rayı toptan atıyor

   Istanbul  Ankara  Izmır
0      30.0    28.0     34

In [6]:
hava_durumu.dropna(axis=1)
#na olan kolonları sildi olmayan tek kolonu gösterdi

   Izmır
0     34
1     32
2     33

In [7]:
sozluk_2 = {"Istanbul" : [30,32,np.nan], "Ankara":[28,np.nan,27], "Izmır": [34,32,33],"Antalya":[39,np.nan,np.nan]}
hava_durumu_2 = pd.DataFrame(sozluk_2)

In [8]:
hava_durumu_2

   Istanbul  Ankara  Izmır  Antalya
0      30.0    28.0     34     39.0
1      32.0     NaN     32      NaN
2       NaN    27.0     33      NaN

In [9]:
hava_durumu_2.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmır
0      30.0    28.0     34
1      32.0     NaN     32
2       NaN    27.0     33

In [10]:
hava_durumu_2.fillna(32)
#boş yerleri istenen değer (32) ile doldurdum

   Istanbul  Ankara  Izmır  Antalya
0      30.0    28.0     34     39.0
1      32.0    32.0     32     32.0
2      32.0    27.0     33     32.0

## groupby

In [1]:
#bizim rowlarımızı sınıflar

In [14]:
maas_sozlugu = {"Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calisan İsmi": ["Ahmet","Mehmet","Sude","Burak","Aleyna","Zeynep"],
               "Maas": [7400,6700,7200,6800,7000,7100]}

In [15]:
maas_data_frame = pd.DataFrame(maas_sozlugu)

In [16]:
maas_data_frame

   Departman Calisan İsmi  Maas
0    Yazılım        Ahmet  7400
1    Yazılım       Mehmet  6700
2  Pazarlama         Sude  7200
3  Pazarlama        Burak  6800
4      Hukuk       Aleyna  7000
5      Hukuk       Zeynep  7100

In [18]:
grup_objesi = maas_data_frame.groupby("Departman")

In [19]:
grup_objesi.count()
#istenene göre ayırdı ve her departmanda çalışan kişi sayısını gösterdi

           Calisan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [21]:
grup_objesi.mean()
#her departmanda çalışan kişilerin ortalama maaşını hesapladı

           Maas
Departman
Hukuk      7050
Pazarlama  7000
Yazılım    7050

In [23]:
grup_objesi.min()
# her departmanda en az maaş alanı gösterdi

          Calisan İsmi  Maas
Departman
Hukuk           Aleyna  7000
Pazarlama        Burak  6800
Yazılım          Ahmet  6700

In [24]:
grup_objesi.max()
# her departmanda en fazla maaş alanı gösterdi

          Calisan İsmi  Maas
Departman
Hukuk           Zeynep  7100
Pazarlama         Sude  7200
Yazılım         Mehmet  7400

In [25]:
grup_objesi.describe()
#detaylı bir analiz veriyor

           Maas
          count    mean         std     min     25%     50%     75%     max
Departman
Hukuk       2.0  7050.0   70.710678  7000.0  7025.0  7050.0  7075.0  7100.0
Pazarlama   2.0  7000.0  282.842712  6800.0  6900.0  7000.0  7100.0  7200.0
Yazılım     2.0  7050.0  494.974747  6700.0  6875.0  7050.0  7225.0  7400.0